In [1]:
%%capture
from functions import *

@register_cell_magic
def markdown(line, cell):
    return md(cell.format(**globals()))

# Student Registration Dataframe

---
The student registration dataframe contains information about the dates that students registered and,if applicable, unregistered from the module.

## Contents

* **code_module**: The code module represents the course which the sutdent registered for.
* **code_presentation**: The code presentation represents the time of year the course which the student registered for began.
* **id_student**: The student ID is the unique identifier for each student.
* **date_registration**: The registration date is the date that the student registered for the module relative to the start of the module. A negative value indicates that many days before the module began.
* **date_unregistration**: The unregistration date is the date that the student unregistered from the course module in relation to the start date of the course, if applicable.

In [2]:
# looking at the student_registration dataframe
student_registration.head()

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

In [3]:
md(f'''

**Size**
    
* Number of Rows: {len(student_registration)}
* Number of Columns: {len(student_registration.columns)}

**Data Types**
''')

**Size**

* Number of Rows: 32593
* Number of Columns: 5

**Data Types**

In [4]:
# show student info data types
student_registration.dtypes

code_module             object
code_presentation       object
id_student               int64
date_registration      float64
date_unregistration    float64
dtype: object

* id_student is currently an int64 datatype, but would be more appropriate as an object data type since it is categorical.

In [5]:
# changing id_student to the object data type
student_registration['id_student'] = student_registration['id_student'].astype(object)

**Null Values:**

In [6]:
student_registration.isnull().sum()

code_module                0
code_presentation          0
id_student                 0
date_registration         45
date_unregistration    22521
dtype: int64

In [7]:
null_registration = student_registration['date_registration'].isnull().sum()
null_unregistration = student_registration['date_unregistration'].isnull().sum()

In [8]:
%%markdown 

* We have {null_registration} null values for date_registration, and no mention of this in the dataset documentation, so we will treat this as missing data.
* There are {null_unregistration} null values for date_unregistration which represent the students that did not withdraw from the course.

* We have 45 null values for date_registration, and no mention of this in the dataset documentation, so we will treat this as missing data.
* There are 22521 null values for date_unregistration which represent the students that did not withdraw from the course.

**Unique Counts:**

In [9]:
student_registration.nunique()

code_module                7
code_presentation          4
id_student             28785
date_registration        332
date_unregistration      416
dtype: int64

**Unique Categorical Values**

In [10]:
unique_vals(student_registration)

code_module: ['AAA' 'BBB' 'CCC' 'DDD' 'EEE' 'FFF' 'GGG']

code_presentation: ['2013J' '2014J' '2013B' '2014B']

id_student: [11391 28400 30268 ... 2648187 2679821 2684003]

In imd_band the % sign is missing in 10-20. We will add that for consistency and clarity

In [11]:
# changing all 10-20 values in student_info imd_band to 10-20% for consistency's sake
student_info.loc[student_info['imd_band'] == '10-20', 'imd_band'] = '10-20%'
print(student_info['imd_band'].explode().unique())

['90-100%' '20-30%' '30-40%' '50-60%' '80-90%' '70-80%' nan '60-70%'
 '40-50%' '10-20%' '0-10%']

**Duplicate Values**

In [12]:
analyze_df(student_registration, dupes=True)

'No Duplicate Values'

In [13]:
md(f'''* The Student info dataframe is {len(student_registration)} rows, but there are only {student_registration['id_student'].nunique()} unique student ID's.
* This suggests that there are some students who took multiple modules since we eliminated those who have taken the same course more than once.
        ''')

* The Student info dataframe is 32593 rows, but there are only 28785 unique student ID's.
* This suggests that there are some students who took multiple modules since we eliminated those who have taken the same course more than once.

In [14]:
student_registration[student_registration['id_student'].duplicated()].head()

,code_module,code_presentation,id_student,date_registration,date_unregistration
395,AAA,2014J,65002,-144.0,NaN
403,AAA,2014J,94961,-150.0,NaN
415,AAA,2014J,129955,-143.0,143.0
422,AAA,2014J,135335,-82.0,24.0
423,AAA,2014J,135400,-51.0,NaN

**Duplicate Student ID's**

In [15]:
# finding student records with duplicate ID's
pd.concat(x for _, x in student_registration.groupby("id_student") if len(x) > 1).head()

,code_module,code_presentation,id_student,date_registration,date_unregistration
14395,DDD,2013J,8462,-137.0,119.0
17560,DDD,2014J,8462,-38.0,18.0
13091,DDD,2013B,24213,-128.0,-46.0
16332,DDD,2014B,24213,-54.0,NaN
2517,BBB,2013J,25629,-31.0,-30.0

In [16]:
duped_sids = student_registration[student_registration['id_student'].duplicated()]
total_sid_dupes = pd.concat(x for _, x in student_registration.groupby("id_student") if len(x) > 1)

In [17]:
md(f'''We have {len(duped_sids)} students whose ID is listed more than once and a total of {len(total_sid_dupes)} duplicate records. These students do seem to be in different courses, and so we will leave them''')

We have 3808 students whose ID is listed more than once and a total of 7346 duplicate records. These students do seem to be in different courses, and so we will leave them

**Statistics:**

In [18]:
student_registration.describe().astype(int)

       date_registration  date_unregistration
count              32548                10072
mean                 -69                   49
std                   49                   82
min                 -322                 -365
25%                 -100                   -2
50%                  -57                   27
75%                  -29                  109
max                  167                  444

* There are 8,612 values for the count of date_unregistration which represents the number of students who withdrew from the course.
* The earliest date_unregistration date is 274 days before the course began, which means these students did not make it to the first day. We are only interested in students who took the course so we must eliminate students who did not attend.

In [19]:
# removing students who withdrew on or before the first day
student_registration = student_registration.drop(student_registration[(student_registration['date_unregistration'] <= 0)].index)
student_registration.reset_index(drop=True).head()

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

In [20]:
# finds the longest module length in courses and prints it
longest_course = courses['module_presentation_length'].max()
longest_unreg = student_registration['date_unregistration'].max().astype(int)
md(f'''* The longest course from module_presentation length in the courses dataframe was {longest_course} days, yet we see here the latest unregistration date is {longest_unreg} days, which is longer than any course went on.
    ''')

* The longest course from module_presentation length in the courses dataframe was 269 days, yet we see here the latest unregistration date is 444 days, which is longer than any course went on.

**All Students with an unregistration point after 269 days:**

In [21]:
# finding students whose courses went on for longer than the maximum course length
student_registration.loc[student_registration['date_unregistration'] > 269]

,code_module,code_presentation,id_student,date_registration,date_unregistration
25249,FFF,2013J,586851,-22.0,444.0

* It seems to be just this one student is an outlier, but should not affect our overall analysis so we will leave this intact